Repository: ZeWaren/flask-i18n-example
Catalog: static/translations/*.po
Languages: fr

source: Brittany
fr: la Bretagne

source: France
fr: la France

source: I am a sausage.
fr: Je suis une saucisse.

source: %(part)s is the best part of %(country)s.
fr: %(part)s est la meilleur région de %(country)s.

source: I bought a garlic glove this morning.
fr: J'ai acheté une gousse d'ail ce matin.

source: We're all sausages!
fr: Nous sommes tous des saucisses.

source: %1 is a bit like %2
fr: %1 est un peu comme %2

source: Chouchen
fr: le Couchen

source: Mead
fr: l'Hydromel

source: This document contains a tip
fr: Ce document contient un tuyau.

source: I am also a sausage.
fr: Je suis aussi une saucisse.

source: %(language1)s is good, but %(language2)s is more fun
fr: Je trouve que %(language2)s est plus fun que %(language1)s.

source: I signed one lease in the last two years.
fr: J'ai signé un bail dans les deux dernières années.
